# coding: utf-8

"""
    Задачи для само проверки
"""

#  1

"""
    Сформировать возрастающий список из четных чисел от 1 до 10 включительно.
"""

int_list = []
# test
assert int_list == [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]


#  2

"""
   Сформировать убывающий список из чисел от 10 до 3.
"""

int_list = []
# test
assert int_list == [10, 9, 8, 7, 6, 5, 4 , 3]

#  3

"""
   Создать список только с четными элементами от 10 до 2.
   Попробовать comprehension и цикл
"""

int_list = []
# test
assert int_list == [10, 8, 6, 4, 2]


#  4

"""
    Сформировать матрицу n x m, состоящую из нулей
    Попробовать comprehension и цикл
"""


#  5

"""
    Дан список, вывести максимальный элемент в списке.
"""


#  6
"""
    Найти сумму 2/3 + 3/4 + 4/5 +...+ 9/10
"""

#  7

"""
    Для произвольной строки получить строку с уникальными символами
    на основе исходной
"""

#  8

"""
    Для произвольной строки найти кол-во вхождений каждого символа
    Попробовать dict
"""


#  9
"""
    Удалить в строке все цифры.
"""

#  10

"""
    Описать класс, реализующий десятичный счетчик, который может увеличивать
    или уменьшать свое значение на единицу в заданном диапазоне.
    Предусмотреть инициализацию счетчика значениями по умолчанию и
    произвольными значениями.
    Счетчик имеет 3 метода: увеличения, уменьшения и
    возвращающий текущее состояние счетчика.
    Написать программу, демонстрирующую все возможности класса.

"""